tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "mas-cli/tap"
tap "railwaycat/emacsmacport"
brew "autoconf"
brew "automake"
brew "bat"
brew "delve"
brew "eza"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "git"
brew "git-crypt"
brew "go"
brew "gopls"
brew "htop"
brew "imagemagick"
brew "libgccjit"
brew "make"
brew "neovim"
brew "node"
brew "pkgconf"
brew "poppler"
brew "pstree"
brew "ripgrep"
brew "rustup"
brew "stow"
brew "tmux"
brew "tree"
brew "vcpkg"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-imagemagick", "with-modern-doom-icon", "with-native-comp", "with-xwidgets"]
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mas-cli/tap/mas"
cask "alfred"
cask "bitwarden"
cask "claude"
cask "cmake"
cask "dropbox"
cask "font-hasklig"
cask "font-hasklug-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "karabiner-elements"
cask "keepingyouawake"
cask "spotify"
cask "tor-browser"
cask "whatsapp"
mas "iMovie", id: 408981434
mas "Xcode", id: 497799835
