tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
brew "bat"
brew "cmake"
brew "eza"
brew "fish"
brew "fzf"
brew "gcc"
brew "git"
brew "htop"
brew "libgccjit"
brew "neovim"
brew "node"
brew "pstree"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "tree"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-imagemagick", "with-modern-doom-icon", "with-native-comp", "with-xwidgets"]
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "alfred"
cask "bitwarden"
cask "claude"
cask "dropbox"
cask "font-hasklig"
cask "font-hasklug-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "karabiner-elements"
cask "spotify"
