tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "mas-cli/tap"
tap "railwaycat/emacsmacport"
brew "autoconf"
brew "automake"
brew "bat"
brew "ghc"
brew "cabal-install"
brew "cloc"
brew "codex"
brew "delve"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "git"
brew "git-crypt"
brew "gitleaks"
brew "go"
brew "gopls"
brew "htop"
brew "imagemagick"
brew "libgccjit"
brew "librespot"
brew "make"
brew "ncspot"
brew "neovim"
brew "node"
brew "pkgconf"
brew "poppler"
brew "pstree"
brew "ripgrep"
brew "rustup"
brew "spotify_player"
brew "stow"
brew "tmux"
brew "tree"
brew "uv"
brew "vcpkg"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-imagemagick", "with-modern-doom-icon", "with-native-comp", "with-xwidgets"]
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mas-cli/tap/mas"
cask "alfred"
cask "bitwarden"
cask "chatgpt"
cask "claude"
cask "cmake-app"
cask "discord"
cask "dropbox"
cask "font-hasklig"
cask "font-hasklug-nerd-font"
cask "font-iosevka"
cask "font-iosevka-term-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "karabiner-elements"
cask "keepingyouawake"
cask "obsidian"
cask "raycast"
cask "spotify"
cask "tor-browser"
cask "visual-studio-code@insiders"
cask "whatsapp"
mas "iMovie", id: 408981434
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "sourcegraph.amp"
vscode "vscodevim.vim"
