tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "mas-cli/tap"
tap "railwaycat/emacsmacport"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bat"
brew "btop"
brew "buf"
brew "ghc"
brew "cabal-install"
brew "clang-format"
brew "cloc"
brew "cmake", link: false
brew "delve"
brew "direnv"
brew "dust"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghcup"
brew "git"
brew "git-crypt"
brew "gitleaks"
brew "go"
brew "gopls"
brew "graphviz"
brew "htop"
brew "imagemagick"
brew "ispell"
brew "just"
brew "kind"
brew "libgccjit"
brew "librespot"
brew "make"
brew "minikube"
brew "ncspot"
brew "neovim"
brew "node"
brew "openjdk"
brew "pandoc"
brew "pkgconf"
brew "pngpaste"
brew "poppler"
brew "pstree"
brew "ripgrep"
brew "ruff"
brew "ruff-lsp"
brew "rustup"
brew "spotify_player"
brew "stow"
brew "tectonic"
brew "tmux"
brew "translate-shell"
brew "tree"
brew "uv"
brew "vcpkg"
brew "wget"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-compress-install", "with-imagemagick", "with-xwidgets"]
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mas-cli/tap/mas"
cask "alfred"
cask "bitwarden"
cask "chatgpt"
cask "claude"
cask "cmake-app"
cask "codex"
cask "copilot-cli"
cask "cursor"
cask "dayflow"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "excalidrawz"
cask "font-fira-code-nerd-font"
cask "font-hasklig"
cask "font-hasklug-nerd-font"
cask "font-iosevka"
cask "font-iosevka-term-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "handbrake-app"
cask "karabiner-elements"
cask "keepingyouawake"
cask "lm-studio"
cask "markedit"
cask "notion"
cask "obs"
cask "obsidian"
cask "racket"
cask "spotify"
cask "tla+-toolbox"
cask "tor-browser"
cask "visual-studio-code@insiders"
cask "whatsapp"
mas "iMovie", id: 408981434
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
vscode "anysphere.cursorpyright"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "sourcegraph.amp"
vscode "tomoki1207.pdf"
vscode "vscodevim.vim"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "emacs-lsp-booster"
cargo "tokei"
